pok3r-custom/pok3r_re_firmware/doc/HT32F1655_56_FWLib_v102_960/example/IAP/IAP_Text/Src_IAP/iap_handler.c
/*********************************************************************************************************//**
 * @file    IAP/IAP_Text/Src_IAP/iap_handler.c
 * @version $Rev:: 929          $
 * @date    $Date:: 2015-09-16 #$
 * @brief   This file contains IAP handler.
 *************************************************************************************************************
 * @attention
 *
 * Firmware Disclaimer Information
 *
 * 1. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, which is supplied by Holtek Semiconductor Inc., (hereinafter referred to as "HOLTEK") is the
 *    proprietary and confidential intellectual property of HOLTEK, and is protected by copyright law and
 *    other intellectual property laws.
 *
 * 2. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, is confidential information belonging to HOLTEK, and must not be disclosed to any third parties
 *    other than HOLTEK and the customer.
 *
 * 3. The program technical documentation, including the code, is provided "as is" and for customer reference
 *    only. After delivery by HOLTEK, the customer shall use the program technical documentation, including
 *    the code, at their own risk. HOLTEK disclaims any expressed, implied or statutory warranties, including
 *    the warranties of merchantability, satisfactory quality and fitness for a particular purpose.
 *
 * <h2><center>Copyright (C) 2014 Holtek Semiconductor Inc. All rights reserved</center></h2>
 ************************************************************************************************************/

/* Includes ------------------------------------------------------------------------------------------------*/
#include "ht32.h"
#include "iap_handler.h"
#include "iap_xmodem.h"
#include "iap_buffer.h"
#include "iap_crc16.h"

/** @addtogroup HT32_Series_Peripheral_Examples HT32 Peripheral Examples
  * @{
  */

/** @addtogroup IAP_Examples IAP
  * @{
  */

/** @addtogroup Text_mode Text mode
  * @{
  */

/** @addtogroup Text_mode_IAP IAP
  * @{
  */


/* Private function prototypes -----------------------------------------------------------------------------*/
void IAP_GoCMD(u32 address);
static void IAP_Download(void);
#if defined (__ICCARM__)
static int PutString(const char *pString);
#define printf PutString
extern int fputc (int ch, FILE *f);
#endif

/* Global functions ----------------------------------------------------------------------------------------*/
/*********************************************************************************************************//**
  * @brief  Jump to user application.
  * @retval None
  ***********************************************************************************************************/
void IAP_Go(void)
{
  u32 SP, PC;

  /*--------------------------------------------------------------------------------------------------------*/
  /* Check Stack Point in range                                                                             */
  /*--------------------------------------------------------------------------------------------------------*/
  SP = rw(IAP_FLASH_START);
  if (SP < HT_SRAM_BASE || SP > IAP_SRAM_END)
  {
    return;      /* Stack Point is not in range, return and start IAP mode                                  */
  }

  /*--------------------------------------------------------------------------------------------------------*/
  /* Check PC in range                                                                                      */
  /*--------------------------------------------------------------------------------------------------------*/
  PC = rw(IAP_FLASH_START + 0x4);
  if (PC < IAP_FLASH_START || PC > IAP_FLASH_END)
  {
    return;      /* Program Counter is not in range, return and start IAP mode                              */
  }

  /*--------------------------------------------------------------------------------------------------------*/
  /* SP and PC is correct, jump to user application                                                         */
  /*--------------------------------------------------------------------------------------------------------*/
  NVIC_DisableIRQ(USART0_IRQn);   /* IAP UART SETTING: Disable UxRT interrupt to prevent unwanted interrupt */

  NVIC_SetVectorTable(NVIC_VECTTABLE_FLASH, IAP_FLASH_START); /* Set Vector Table Offset                    */
  IAP_GoCMD(IAP_FLASH_START);

  return;
}

#if defined (__CC_ARM)
/*********************************************************************************************************//**
  * @brief  Jump to user application by change PC.
  * @param  address: Start address of user application
  * @retval None
  ***********************************************************************************************************/
__asm void IAP_GoCMD(u32 address)
{
  LDR R1, [R0]
  MOV SP, R1
  LDR R1, [R0, #4]
  BX R1
}
#elif defined (__ICCARM__)
void IAP_GoCMD(u32 address)
{
  __asm("LDR R1, [R0]");
  __asm("MOV SP, R1");
  __asm("LDR R1, [R0, #4]");
  __asm("BX R1");
}
#endif

/*********************************************************************************************************//**
  * @brief  Download image to Flash.
  * @retval None
  ***********************************************************************************************************/
static void IAP_Download(void)
{
  u32 i;
  u32 result;
  u8 IAP_Buffer[134];                      /* Packet size 133 + 1 since Xmodem data put from 1 ~ 133        */

  printf("\r\nErasing Flash! Please Wait....\r\n");
  /*--------------------------------------------------------------------------------------------------------*/
  /* Erase Flash for application                                                                            */
  /*--------------------------------------------------------------------------------------------------------*/
  for (i = IAP_FLASH_START; i < IAP_FLASH_END; i += FLASH_PAGE_SIZE)
  {
    FLASH_ErasePage(i);
  }

  /*--------------------------------------------------------------------------------------------------------*/
  /* Start file download and programming                                                                    */
  /*--------------------------------------------------------------------------------------------------------*/
  result = xmodem(IAP_Buffer, IAP_FLASH_START,  XMODEM_PROGRAM);

  if (result == X_SSUCCESS)
  {
    printf("\r\n\r\nSuccessful!\r\n");
  }
  else
  {
    printf("\r\n\r\nFailed!\r\n");
    while (1);
  }

}

/*********************************************************************************************************//**
  * @brief  IAP mode handler.
  * @retval None
  ***********************************************************************************************************/
void IAP_Handler(void)
{
  u8 input;
  u32 isFlashProtection = FALSE;
  FLASH_OptionByte Option;

  /*--------------------------------------------------------------------------------------------------------*/
  /* Reset SBVT1 which set by user's application, to avoid start IAP again                                  */
  /*--------------------------------------------------------------------------------------------------------*/
  HT_FLASH->SBVT[1] = 0x00000000;

  while (1)
  {
    /* Get Option Byte status                                                                               */
    FLASH_GetOptionByteStatus(&Option);

    /* Check Application page is protection or not                                                          */
    isFlashProtection = Option.WriteProtect[0] & ~(IAP_PAGE);
    isFlashProtection |= Option.WriteProtect[1];
    isFlashProtection |= Option.WriteProtect[2];
    isFlashProtection |= Option.WriteProtect[3];

    printf("\r\n\r\nHoltek IAP Example Code\r\n");
    printf(" [1] Execute The New Program\r\n");
    printf(" [2] Disable Write Protection\r\n");
    printf(" [3] Update AP\r\n");

    input = ReadBuffer();
    printf("\r\n");

    switch (input)
    {
      case '1':
      {
        IAP_Go();
        printf("\r\nImage format is incorrect!\r\n");
        break;
      }
      case '2':
      {
        if (isFlashProtection != 0)
        {
          if (Option.MainSecurity == ENABLE || Option.OptionProtect == ENABLE)
          {
            printf("Security or Option Protection is enabled. Can not modify Option.\r\n");
          }
          else
          {
            FLASH_ErasePage(OPTION_BYTE_BASE);
            //Option.WriteProtect[0] &= IAP_PAGE;
            //Option.WriteProtect[1] = 0;
            //Option.WriteProtect[2] = 0;
            //Option.WriteProtect[3] = 0;
            //FLASH_ProgramOptionByte(&Option);

            printf("Write Protection disabled. Trigger reset to reload Option Byte\r\n");
            HT_FLASH->SBVT[1] = 0x55AAFAF5;

            NVIC_SystemReset();
          }
        }
        else
        {
          printf("Write Protection is not enabled!\r\n");
        }
        break;
      }
      case '3':
      {
        if (isFlashProtection == 0)
        {
          IAP_Download();
        }
        else
        {
          printf("\r\nWrite Protection is enabled. Can not update image.\r\n");
        }
        break;
      }
    }
  }
}

#if defined (__ICCARM__)
/*********************************************************************************************************//**
 * @brief Put string.
 * @param pString: String.
 * @retval String length.
 ************************************************************************************************************/
static int PutString(const char *pString)
{
  int i = 0;
  while (*pString != '\0')
  {
    fputc(*pString, (FILE *)1);
    pString++;
    i++;
  }

  return i;
}
#endif


/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */
